Repository: alexminza/wc-moldovaagroindbank
Catalog: languages/wc-moldovaagroindbank-*.po
Languages: ro_ro, ru_ru

source: Payment Gateway for maib for WooCommerce
ro_ro: Gateway de plată pentru maib pentru WooCommerce
ru_ru: Платежный шлюз для maib для WooCommerce

source: Accept Visa and Mastercard directly on your store with the Payment Gateway for maib for WooCommerce.
ro_ro: Acceptă plata cu carduri Visa și Mastercard direct în magazin cu gateway-ul de plată maib pentru WooCommerce.
ru_ru: Принимайте оплату картами Visa и Mastercard прямо в своем магазине с помощью платежного шлюза maib для WooCommerce.

source: Accept Visa and Mastercard through maib.
ro_ro: Acceptați Visa și Mastercard prin maib.
ru_ru: Принимайте карты Visa и Mastercard через maib.

source: Enable/Disable
ro_ro: Activare/Dezactivare
ru_ru: Включить/Выключить

source: Enable this gateway
ro_ro: Activează acest gateway de plată
ru_ru: Включить платежный шлюз

source: Title
ro_ro: Titlu
ru_ru: Наименование

source: Payment method title that the customer will see during checkout.
ro_ro: Titlul metodei de plată afișat clientului în timpul plății.
ru_ru: Заголовок, который видит пользователь в процессе оформления заказа.

source: Description
ro_ro: Descriere
ru_ru: Описание

source: Payment method description that the customer will see during checkout.
ro_ro: Descrierea metodei de plată afișată clientului în timpul plății.
ru_ru: Описание метода оплаты, которое клиент будет видеть при оформлении заказа.

source: Online payment with Visa / Mastercard bank cards issued by any bank in Moldova or abroad, processed through maib online payment system.
ro_ro: Plată online cu carduri bancare Visa / Mastercard emise de orice bancă din Moldova sau din străinătate, procesată prin sistemul de plăți online al maib.
ru_ru: Онлайн-оплата банковскими картами Visa / Mastercard, выпущенными любым банком в Молдове или за рубежом, через систему онлайн-платежей maib.

source: Logo
ru_ru: Логотип

source: Payment method logo image that the customer will see during checkout.
ro_ro: Sigla metodei de plată afișată clientului în timpul plății.
ru_ru: Изображение логотипа способа оплаты, которое клиент будет видеть при оформлении заказа.

source: Bank logo
ro_ro: Logo bancă
ru_ru: Логотип банка

source: Payment systems logos
ro_ro: Logo sisteme de plăți
ru_ru: Логотипы платежных систем

source: Test mode
ro_ro: Mod testare
ru_ru: Тестовый режим

source: Enabled
ro_ro: Activat
ru_ru: Включен

source: Use Test or Live bank gateway to process the payments. Disable when ready to accept live payments.
ro_ro: Conectare la mediul de Test sau Producție al băncii pentru procesarea plăților. Dezactivați atunci când sunteți gata să acceptați plăți reale.
ru_ru: Использовать Тестовый или Рабочий платежный шлюз на стороне банка. Отключить, когда будете готовы принимать реальные платежи.

source: Debug mode
ro_ro: Mod depanare
ru_ru: Режим отладки

source: Enable logging
ro_ro: Activează jurnalizare
ru_ru: Включить журналирование

source: View logs
ro_ro: Vizualizați jurnalele
ru_ru: Просмотреть журналы

source: Save debug messages to the WooCommerce System Status logs. Note: this may log personal information. Use this for debugging purposes only and delete the logs when finished.
ro_ro: Salvare mesaje de depanare în logurile de stare sistem ale WooCommerce. Notă: acest lucru poate înregistra informații personale. Utilizați această opțiune numai pentru depanare și ștergeți jurnalele atunci când ați terminat.
ru_ru: Сохранять отладочные сообщения в системный журнал WooCommerce. Внимание: могут быть записаны персональные данные. Используйте эту опцию только для отладки и удалите журналы по завершению.

source: Transaction type
ro_ro: Tip tranzacție
ru_ru: Тип транзакции

source: Select how transactions should be processed. Charge submits all transactions for settlement, Authorization simply authorizes the order total for capture later.
ro_ro: Selectează modul în care vor fi procesate plățile. Charge trimite imediat toate tranzacțiile la bancă pentru decontare, Authorization doar autorizează suma comenzii la bancă pentru decontare ulterioară.
ru_ru: Выберите способ обработки платежей. Charge немедленно отправляет все транзакции в банк для расчета, Authorization просто авторизует в банке сумму заказа для последующего расчета.

source: Charge
ro_ro: Plată (Charge)
ru_ru: Оплата (Charge)

source: Authorization
ro_ro: Autorizare (Authorization)
ru_ru: Авторизация (Authorization)

source: Order description
ro_ro: Descriere comandă
ru_ru: Описание заказа

source: Format: <code>%1$s</code> - Order ID
ro_ro: Format: <code>%1$s</code> - ID Comandă
ru_ru: Формат: <code>%1$s</code> - номер заказа

source: Order description that the customer will see on the bank payment page.
ro_ro: Descrierea comenzii afișată clientului pe pagina băncii în timpul plății.
ru_ru: Описание заказа, которое клиент будет видеть при оплате на странице банка.

source: Connection Settings
ro_ro: Setări conexiune
ru_ru: Настройки подключения

source: Use Basic settings to upload the key files received from the bank or configure manually using Advanced settings below.
ro_ro: Utilizați Setările de bază pentru a încărca fișierele cu chei primite de la bancă sau configurați manual utilizând Setările avansate de mai jos.
ru_ru: Используйте Простые настройки для загрузки файлов ключей, полученных из банка, или установите вручную, используя Расширенные настройки ниже.

source: Basic settings&raquo;
ro_ro: Setări de bază&raquo;
ru_ru: Простые настройки&raquo;

source: Advanced settings&raquo;
ro_ro: Setări avansate&raquo;
ru_ru: Расширенные настройки&raquo;

source: Client certificate (PFX)
ro_ro: Certificat client (PFX)
ru_ru: Сертификата клиента (PFX)

source: Uploaded PFX certificate will be processed and converted to PEM format. Advanced settings will be overwritten and configured automatically.
ro_ro: Certificatul PFX încărcat va fi procesat și transformat în format PEM. Setările avansate vor fi suprascrise și configurate automat.
ru_ru: Загруженный сертификат PFX будет обработан и преобразован в формат PEM. Расширенные настройки будут перезаписаны и заданы автоматически.

source: Client certificate file
ro_ro: Fișier certificat client
ru_ru: Файл сертификата клиента

source: Private key file
ro_ro: Fișier cheie privată
ru_ru: Файл закрытого ключа

source: Certificate / private key passphrase
ro_ro: Parolă certificat / cheie privată
ru_ru: Пароль сертификата / закрытого ключа

source: Leave empty if certificate / private key is not encrypted.
ro_ro: Lăsați vid dacă certificatul / cheia privată nu sunt criptate.
ru_ru: Оставьте пустым, если сертификат / закрытый ключ не зашифрованы.

source: Optional
ro_ro: Opțional
ru_ru: Необязательно

source: Payment Notification
ro_ro: Notificare plăți
ru_ru: Уведомление об оплате

source: Provide this URL to the bank to enable online payment notifications.
ro_ro: Furnizați băncii această adresă URL pentru activare notificări de plată online.
ru_ru: Предоставьте этот URL-адрес банку для получения онлайн уведомлений о платежах.

source: Callback URL
ro_ro: URL apel invers (Callback URL)
ru_ru: URL обратного вызова (Callback URL)

source: Certificate valid until %1$s
ro_ro: Certificatul este valabil până la %1$s
ru_ru: Сертификат действителен до %1$s

source: Invalid certificate
ro_ro: Certificat nevalid
ru_ru: Невалидный сертификат

source: Could not validate certificate
ro_ro: Nu s-a putut valida certificatul
ru_ru: Ошибка проверки сертификата

source: Invalid private key or wrong private key passphrase
ro_ro: Cheie privată nevalidă sau parolă cheie privată incorectă
ru_ru: Невалидный закрытый ключ или неправильный пароль закрытого ключа

source: Private key does not correspond to client certificate
ro_ro: Cheia privată nu corespunde certificatului client
ru_ru: Закрытый ключ не соответствует сертификату клиента

source: Could not validate private key
ro_ro: Nu s-a putut valida cheia privată
ru_ru: Ошибка проверки закрытого ключа

source: Invalid value
ro_ro: Valoare nevalidă
ru_ru: Недопустимое значение

source: File not found
ro_ro: Fișierul nu a fost găsit
ru_ru: Файл не найден

source: File not readable
ro_ro: Fișierul nu poate fi citit
ru_ru: Ошибка чтения файла

source: Could not validate file
ro_ro: Nu s-a putut valida fișierul
ru_ru: Ошибка проверки файла

source: Invalid certificate or wrong passphrase
ro_ro: Certificat nevalid sau parolă incorectă
ru_ru: Невалидный сертификат или неправильный пароль

source: Unable to save data to temporary file: %1$s
ro_ro: Nu s-au putut salva datele in fișier temporar: %1$s
ru_ru: Ошибка записи данных во временный файл: %1$s

source: Order #%1$s payment initiated via %2$s: %3$s
ro_ro: Plata comenzii #%1$s a fost inițiată prin %2$s: %3$s
ru_ru: Платеж заказа #%1$s инициирован через %2$s: %3$s

source: Order #%1$s payment initiation failed via %2$s.
ro_ro: Inițierea plății comenzii #%1$s prin %2$s a eșuat.
ru_ru: Ошибка инициирования оплаты заказа #%1$s через %2$s.

source: Order #%1$s payment completed via %2$s: %3$s
ro_ro: Plata comenzii #%1$s a fost finalizată prin %2$s: %3$s
ru_ru: Платеж заказа #%1$s проведен через %2$s: %3$s

source: Order #%1$s payment completion via %2$s failed.
ro_ro: Finalizarea plății comenzii #%1$s prin %2$s a eșuat.
ru_ru: Ошибка проведения платежа по заказу #%1$s через %2$s.

source: %1$s Transaction ID not found for order #%2$s.
ro_ro: Identificatorul tranzacției (%1$s Transaction ID) nu a fost găsit pentru comanda #%2$s.
ru_ru: Идентификатор транзакции (%1$s Transaction ID) не найден для заказа #%2$s.

source: Transaction status from %1$s for order #%2$s: %3$s
ro_ro: Status tranzacție prin %1$s pentru comanda #%2$s: %3$s
ru_ru: Статус платежа через %1$s для заказа #%2$s: %3$s

source: Could not retrieve transaction status from %1$s for order #%2$s.
ro_ro: Verificarea statusului tranzacției prin %1$s pentru comanda #%2$s a eșuat.
ru_ru: Ошибка запроса статуса платежа через %1$s для заказа #%2$s.

source: This Callback URL works and should not be called directly.
ro_ro: Această adresă de apel invers (Callback URL) funcționează și nu trebuie apelată direct.
ru_ru: Этот URL обратного вызова (Callback URL) работает и не должен вызываться напрямую.

source: Payment verification failed: Transaction ID not received from %1$s.
ro_ro: Verificarea plății a eșuat: Transaction ID nu a fost primit de la %1$s.
ru_ru: Ошибка проверки платежа: идентификатор транзакции (Transaction ID) не получен от %1$s.

source: Order not found by Transaction ID: %1$s received from %2$s.
ro_ro: Comanda nu a fost gasită după Transaction ID: %1$s primit de la %2$s.
ru_ru: Заказ не найден по идентификатору транзакции (Transaction ID): %1$s полученному от %2$s.

source: Order #%1$s payment authorized via %2$s: %3$s
ro_ro: Plata comenzii #%1$s a fost autorizată prin %2$s: %3$s
ru_ru: Оплата заказа #%1$s авторизована через %2$s: %3$s

source: Order #%1$s payment failed via %2$s.
ro_ro: Plata comenzii #%1$s prin %2$s a eșuat.
ru_ru: Ошибка оплаты заказа #%1$s через %2$s.

source: Order #%1$s missing meta field %2$s.
ro_ro: Comanda #%1$s lipsește câmpul meta %2$s.
ru_ru: В заказе #%1$s отсутствует мета-поле %2$s.

source: Order #%1$s refund of %2$s via %3$s approved.
ro_ro: Rambursarea comenzii #%1$s în valoare de %2$s prin %3$s a fost aprobată.
ru_ru: Возврат заказа #%1$s в сумме %2$s через %3$s подтвержден.

source: Order #%1$s refund of %2$s via %3$s failed.
ro_ro: Rambursarea comenzii #%1$s în valoare de %2$s prin %3$s a eșuat.
ru_ru: Ошибка возврата заказа #%1$s в сумме %2$s через %3$s.

source: Close business day via %1$s succeeded: %2$s
ro_ro: Închiderea zilei economice prin %1$s a fost efectuată cu succes: %2$s
ru_ru: Завершение бизнес-дня через %1$s прошло успешно: %2$s

source: %1$s is not properly configured.
ro_ro: %1$s nu este configurat corect.
ru_ru: %1$s настроен неправильно.

source: Close business day via %1$s failed: %2$s
ro_ro: Închiderea zilei economice prin %1$s a eșuat: %2$s
ru_ru: Ошибка завершения бизнес-дня через %1$s: %2$s

source: Complete %1$s transaction
ro_ro: Finalizează tranzacția prin %1$s
ru_ru: Провести платеж через %1$s

source: Verify %1$s transaction
ro_ro: Verifică tranzacția prin %1$s
ru_ru: Проверить платеж через %1$s

source: Scheduled action %1$s is already registered.
ro_ro: Acțiunea programată %1$s este deja înregistrată.
ru_ru: Запланированное действие %1$s уже зарегистрировано.

source: Registered scheduled action %1$s in timezone %2$s with ID %3$s.
ro_ro: Acțiunea programată %1$s a fost înregistrată în fusul orar %2$s cu ID %3$s.
ru_ru: Зарегистрировано запланированное действие %1$s в часовом поясе %2$s с ID %3$s.

source: Unregistered scheduled action %1$s.
ro_ro: Acțiunea programată %1$s a fost anulată.
ru_ru: Запланированное действие %1$s отменено.

source: Unsupported store currency
ro_ro: Valuta magazinului nu este suportată
ru_ru: Валюта магазина не поддерживается

source: Supported currencies
ro_ro: Valute suportate
ru_ru: Поддерживаемые валюты

source: See plugin documentation for <a href="https://wordpress.org/plugins/%1$s/#installation" target="_blank">installation instructions</a>.
ro_ro: Consultați documentația modulului pentru <a href="https://wordpress.org/plugins/%1$s/#installation" target="_blank">instrucțiuni de instalare</a>.
ru_ru: Перейдите на страницу документации плагина для <a href="https://wordpress.org/plugins/%1$s/#installation" target="_blank">инструкций по установке</a>.

source: Not configured
ro_ro: Neconfigurat
ru_ru: Не настроено

source: %1$s field must be set.
ro_ro: Câmpul %1$s trebuie setat.
ru_ru: В поле %1$s должно быть задано значение.

source: %1$s is not properly configured. Verify plugin <a href="%2$s">Connection Settings</a>.
ro_ro: %1$s nu este configurat corect. Verificați <a href="%2$s">Setările de conexiune</a>.
ru_ru: %1$s настроен неправильно. Проверьте <a href="%2$s">Настройки подключения</a> плагина.

source: See <a href="%2$s">%1$s settings</a> page for log details and setup instructions.
ro_ro: Consultați pagina de <a href="%2$s">setări %1$s</a> pentru vizualizarea jurnalului și instrucțiuni de configurare.
ru_ru: Перейдите на страницу <a href="%2$s">настроек %1$s</a> для просмотра сведений журнала и инструкций по установке.

source: TEST: %1$s
ru_ru: ТЕСТ: %1$s

source: Settings
ro_ro: Setări
ru_ru: Настройки
